Конфигурация/Documents/ПоручениеНаДвижениеДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ПоручениеНаДвижениеДенежныхСредств</Name>
			<BasedOn>
				<xr:Item>Document.НачислениеЗадолженности</xr:Item>
				<xr:Item>Document.ПогашениеПаев</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствамПоПоручениям</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчетПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦелиВозвратаДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводВсехАктивов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПередачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыПередачиПоручений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧерезАгента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИВремяПолучения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОперацийПриВводеВыводеДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИсполненияС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИсполненияПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>210</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗадолженности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоручениеНаПереводМеждуСчетамиДУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентДоговорТекстом</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РасчетНДФЛПайщиков</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеДивидендов</v8:Type>
						<v8:Type>cfg:DocumentRef.ПогашениеПаев</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Documents/ПоручениеНаДвижениеДенежныхСредств/Ext/ObjectModule.bsl
Процедура ПроведениеПоРегистрамБэкОфиса(Отказ) Экспорт
	
	// новая схема проведения
	РаботаСРегистрамиНакопления.ОчиститьДвиженияПоБэкофису(ЭтотОбъект);
	
	Движения.ЗадолженностиПоДенежнымСредствамПоПоручениям.Записывать = Истина;
	
	Если Не ЭтотОбъект.ВыводВсехАктивов Тогда
		
		// задолженности по д/с
		Движение = Движения.ЗадолженностиПоДенежнымСредствамПоПоручениям.ДобавитьПриход();
		
		Движение.Период                       = ЭтотОбъект.Дата;
		Движение.Организация 				  = ЭтотОбъект.Организация;
		Движение.Основание	 				  = ?(ЗначениеЗаполнено(ЭтотОбъект.Основание), ЭтотОбъект.Основание, ЭтотОбъект.Ссылка);
		Движение.ТипЗадолженности 			  = ЭтотОбъект.ТипЗадолженности;
		Движение.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
		Движение.Валюта 					  = ЭтотОбъект.Валюта;
		Движение.Сумма 						  = ЭтотОбъект.Сумма;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроведениеПоРегиструБухгалтерии(УчетныйРегистр, Отказ) Экспорт
	
	Если ЭтотОбъект.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления <> Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПФР 
			ИЛИ ЭтотОбъект.ВыводВсехАктивов 
			ИЛИ ЭтотОбъект.СпособПередачи = Перечисления.СпособыПередачиПоручений.ВнутренняяСистема Тогда // по внутренним поручения нет проводок
		// Не формируются движения по бухучету
		Возврат;
	КонецЕсли;
	
	СчетРасчетовСАгентом = БухгалтерскийУчет.ОпределитьНастройкуУчета(
		ЭтотОбъект.Дата, 
		ЭтотОбъект.Организация, 
		ЭтотОбъект.СчетДоверительногоУправления,
		"СчетРасчетовСАгентом");

	Если НЕ ЗначениеЗаполнено(СчетРасчетовСАгентом) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось определить счет учета расчетов с агентом для вывода денежных средств ",,,,Отказ);
	КонецЕсли; 	
	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ВидДвиженияДенежныхСредств) Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен Вид движения денежных средств",,,,Отказ);		
	КонецЕсли;	
	
	Движения[УчетныйРегистр].Записывать = Истина;
	
	УчетныйРегистр = Движения[УчетныйРегистр].Метаданные().Имя;
		
	Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], ЭтотОбъект.Сумма, "Требование на вывод ДС");
	Проводка.СчетДт 				= ПланыСчетов.Основной.ЦелевоеФинансированиеПФРВозврат;
	Проводка.СчетКт 				= СчетРасчетовСАгентом;	
	
	Если СчетРасчетовСАгентом.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.Контрагенты) <> Неопределено Тогда
		Проводка.СубконтоКт.Контрагенты = Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(СчетДоверительногоУправления,ЭтотОбъект.Дата);	
	КонецЕсли; 
	
	Проводка.СубконтоДт.ВидДвиженияДенежныхСредств = ЭтотОбъект.ВидДвиженияДенежныхСредств;
	
КонецПроцедуры

#Область ОБРАБОТЧИКИ_СОБЫТИЙ
	 
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект, ДанныеЗаполнения);
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	Основание           = Неопределено;
	
	// получим вывод дс, "на основании" которого вводится поручение
	Если      ТипДанныхЗаполнения = Тип("ДанныеФормыСтруктура") И ДанныеЗаполнения.Свойство("Ссылка") Тогда
		Основание = ДанныеЗаполнения.Ссылка;
		Если ТипЗнч(Основание) <> Тип("ДокументСсылка.ВыводДенежныхСредств") Тогда
			Основание = Неопределено;
		КонецЕсли;
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ВыводДенежныхСредств") Тогда
		Основание = ДанныеЗаполнения;
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, "Организация, СчетДоверительногоУправления, РасчетныйСчет, Сумма");
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.НачислениеЗадолженности") Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, "Организация, СчетДоверительногоУправления, Валюта, РасчетныйСчет");
		
		//Начисление задолженности по НДФЛ создается на основании:
		//1. Расчет НДФЛ - при этом в ЗадолженностиПоДенежнымСредствам в значение ресурса "основание" записывается сам документ "Начисление задолженности"
		//2. Начисление дивидендов - в ЗадолженностиПоДенежнымСредствам в "основание" записывается документ "Начисление дивидендов".
		//Для документа "Поручение на движение денежных средств" в "основание" нужно записать значение по той же логике:
		//в первом случае - "Начисление задолженности", во втором случае - "Начисление дивидендов".
		Если ЗначениеЗаполнено(ДанныеЗаполнения.ВидЗадолженности) И ДанныеЗаполнения.ВидЗадолженности.ПринадлежитЭлементу(Справочники.ВидыЗадолженности.НДФЛ) 
			И ДанныеЗаполнения.Основания.Количество() = 1 И ТипЗнч(ДанныеЗаполнения.Основания[0].Основание) = Тип("ДокументСсылка.НачислениеДивидендов") Тогда
				
			ЭтотОбъект.Основание = ДанныеЗаполнения.Основания[0].Основание;
								
		Иначе
			ЭтотОбъект.Основание = ДанныеЗаполнения;
		КонецЕсли;
		
		ЭтотОбъект.СпособПередачи = ПредопределенноеЗначение("Перечисление.СпособыПередачиПоручений.ВнутренняяСистема");
		
		РасчетныйСчетИзНастроек = РегистрыСведений.НастройкиУчетаДоходовПоЦеннымБумагам.ПолучитьРасчетныйСчетИзНастроек(ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.Валюта);
		
		Если ЗначениеЗаполнено(РасчетныйСчетИзНастроек) Тогда
			ЭтотОбъект.РасчетныйСчет = РасчетныйСчетИзНастроек;				
		КонецЕсли;
		
		ЭтотОбъект.ТипЗадолженности = ПредопределенноеЗначение("Перечисление.ТипыЗадолженности.Кредиторская");
		ЭтотОбъект.ДатаИсполненияС = ТекущаяДата();
		ЭтотОбъект.ДатаИсполненияПо = Справочники.Календари.ДобавитьКДатеРабочиеДни(Справочники.Календари.Общероссийский, ЭтотОбъект.ДатаИсполненияС, 5); 
		
		ЭтотОбъект.Сумма = ДанныеЗаполнения.Основания.Итог("Сумма");
		
		Возврат;
		
	КонецЕсли;

	Если ЗначениеЗаполнено(Основание) Тогда
		ЭтотОбъект.Дата	= Основание.Дата - 360;
	Иначе
		Если ТипЗнч(ДанныеЗаполнения) <> Тип("Структура") Тогда
			ДанныеЗаполнения = Новый Структура();
		КонецЕсли;
	КонецЕсли;	
		
КонецПроцедуры 

Процедура ПриКопировании(ОбъектКопирования)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект);
	
	ЭтотОбъект.ДатаИВремяПолучения 	= "";
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтотОбъект.ВыводВсехАктивов Тогда
		
		Если ПроверяемыеРеквизиты.Найти("РасчетныйСчет") <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("РасчетныйСчет"));
		КонецЕсли;
				
		Если ПроверяемыеРеквизиты.Найти("Сумма") <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Сумма"));
		КонецЕсли;
		
		Если ПроверяемыеРеквизиты.Найти("Валюта") <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Валюта"));
		КонецЕсли;
		
	КонецЕсли;
			
	Если ПроверяемыеРеквизиты.Найти("СпособПередачи") <> Неопределено
		И (НЕ ЭтоНовый() И НЕ ЗначениеЗаполнено(Ссылка.СпособПередачи)
			ИЛИ НЕ РаботаСДокументами.СчетДоверительногоУправленияПоЛицензииПоУправлениюЦеннымиБумагами(ЭтотОбъект.Дата, ЭтотОбъект.СчетДоверительногоУправления)) Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("СпособПередачи"));
	КонецЕсли;
	
	ВидДоговораДоверительногоУправления = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.СчетДоверительногоУправления, "ВидДоговораДоверительногоУправления");
	
	Если ВидДоговораДоверительногоУправления <> Перечисления.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет
		Или ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет И ЭтотОбъект.ТипЗадолженности = Перечисления.ТипыЗадолженности.Дебиторская Тогда
		Если ПроверяемыеРеквизиты.Найти("ВидОперации") <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ВидОперации"));
		КонецЕсли;
	КонецЕсли;
		
	Если ЭтотОбъект.СпособПередачи = Перечисления.СпособыПередачиПоручений.ВнутренняяСистема Тогда
		ПроверяемыеРеквизиты.Добавить("РасчетныйСчет");	
	ИначеЕсли РаботаСДокументамиКлиентСервер.ТребуетсяПроверкаЗаполненияЗначенияКонтрагента(ЭтотОбъект) Тогда
		ПроверяемыеРеквизиты.Добавить("Контрагент");
	КонецЕсли;
		
	Если ЭтотОбъект.Дата < Дата(2021, 07, 30) Тогда
		
		Если ПроверяемыеРеквизиты.Найти("ДатаИсполненияС") <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ДатаИсполненияС"));	
		КонецЕсли;
		
		Если ПроверяемыеРеквизиты.Найти("ДатаИсполненияПо") <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ДатаИсполненияПо"));	
		КонецЕсли;
		
	КонецЕсли;
			
	УниверсальныеМеханизмы.ПослеОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// предварительная обработка объекта
	РаботаСДокументами.ПередЗаписью(ЭтотОбъект);

	// блокирующие проверки
	Если Не УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли; 
	
	//Проверим наличие акцепта. Если есть акцепт - нельзя вносить изменения в поручение.
	Если Не ЭтотОбъект.ДополнительныеСвойства.ЭтоНовый
		И ЭтотОбъект.ТипЗадолженности = Перечисления.ТипыЗадолженности.Кредиторская
		И (РаботаСДокументами.ИзмененыРеквизитыШапкиДокумента(ЭтотОбъект, "ПометкаУдаления, СчетДоверительногоУправления, РасчетныйСчет, Основание, ВыводВсехАктивов, СпособПередачи, Сумма, Валюта, ДатаИсполненияС, ДатаИсполненияПо")
			Или РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения)
		И РаботаСДокументами.ПоручениеНаВыводАктивовСогласовано(ЭтотОбъект.Ссылка, ТекущаяДата()) Тогда	

		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нельзя вносить изменения в поручение, которое прошло процедуру согласования.", ЭтотОбъект,,, Отказ);	
		
	КонецЕсли;

	Если РаботаСДокументами.ЭтоРежимПроведения(ЭтотОбъект, РежимЗаписи) Тогда
				
		Если Не Отказ Тогда
			РаботаСДокументами.ВыполнитьСверкуСоСпискомНедействительныхПаспортовОтложенноПоПоручениюНаВыводАктивов(ЭтотОбъект);
		КонецЕсли;
		
		Если ЭтотОбъект.ВыводВсехАктивов Тогда
			
			Если ЗначениеЗаполнено(ЭтотОбъект.Сумма) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='При выводе всех активов значение реквизита ""Сумма"" должно быть пустым!'"), ЭтотОбъект, "Сумма",, Отказ);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ЭтотОбъект.Валюта) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='При выводе всех активов значение реквизита ""Валюта"" должно быть пустым!'"), ЭтотОбъект, "Валюта",, Отказ);		
			КонецЕсли;
			
		Иначе
			
			Если ЗначениеЗаполнено(РасчетныйСчет) И (ЭтотОбъект.Валюта <> ЭтотОбъект.РасчетныйСчет.Валюта) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Валюта расчетного счета ""Откуда"" отличается от валюты поручения!'"), ЭтотОбъект, "РасчетныйСчет",, Отказ);
			КонецЕсли;
		
			Если ЗначениеЗаполнено(РасчетныйСчетПолучатель) И (ЭтотОбъект.Валюта <> ЭтотОбъект.РасчетныйСчетПолучатель.Валюта) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Валюта расчетного счета ""Куда"" отличается от валюты поручения!'"), ЭтотОбъект, "РасчетныйСчетПолучатель",, Отказ);
			КонецЕсли;
						
		КонецЕсли;
		
		// Период исполнения не может быть ранее даты документа
		Если ЭтотОбъект.Дата >= Дата(2021, 07, 30) Тогда
			
			Если ДатаИсполненияС < НачалоДня(Дата) Тогда
		        ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Дата начала периода исполнения не может быть раньше даты поручения'"), ЭтотОбъект, "ДатаИсполненияС",, Отказ);
			КонецЕсли;
			
			Если ДатаИсполненияПо < НачалоДня(Дата) Тогда
		        ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Дата окончания периода исполнения не может быть раньше даты поручения'"), ЭтотОбъект, "ДатаИсполненияПо",, Отказ);
			КонецЕсли;
			
		КонецЕсли;
				
		Если ЭтотОбъект.ТипЗадолженности = Перечисления.ТипыЗадолженности.Дебиторская И ЗначениеЗаполнено(ЭтотОбъект.ОписаниеДенежныхСредств) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='При вводе денежных средств значение реквизита ""Описание денежных средств"" должно быть пустым!'"), ЭтотОбъект, "ОписаниеДенежныхСредств",, Отказ);
		КонецЕсли;
							
		Если ЭтотОбъект.СпособПередачи = Перечисления.СпособыПередачиПоручений.ВнутренняяСистема Тогда
			
			Если Не РаботаСдокументами.ДействуетКонтрольПорученийВнутреннейСистемы(ЭтотОбъект.Дата, ЭтотОбъект.Организация) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Механизм акцептования внутренних поручений неактивен.", ЭтотОбъект, "СпособПередачи",, Отказ);
				Возврат;
			КонецЕсли;
						
			Если ЗначениеЗаполнено(ЭтотОбъект.Основание) Тогда
				
				Если Не РаботаСДокументами.ЗначенияРеквизитовСоответствуютОснованиюПоручения(ЭтотОбъект) Тогда
					Отказ = Истина;
				КонецЕсли;
				
				БлокировкаДанных = Новый БлокировкаДанных;
	
				ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрНакопления.ЗадолженностиПоДенежнымСредствамПоПоручениям");
				
				ЭлементБлокировкиДанных.УстановитьЗначение("Организация", ЭтотОбъект.Организация);
				ЭлементБлокировкиДанных.УстановитьЗначение("Основание", ЭтотОбъект.Основание);
				
				БлокировкаДанных.Заблокировать();
					
				//проверка наличия раннее созданного поручения на основании "Начисления задолженности".
				Запрос = Новый Запрос;
				Запрос.Текст =
					"ВЫБРАТЬ РАЗРЕШЕННЫЕ
					|	ЗадолженностиПоДенежнымСредствамПоПоручениям.Регистратор КАК Регистратор
					|ИЗ
					|	РегистрНакопления.ЗадолженностиПоДенежнымСредствамПоПоручениям КАК ЗадолженностиПоДенежнымСредствамПоПоручениям
					|ГДЕ
					|	ЗадолженностиПоДенежнымСредствамПоПоручениям.Регистратор <> &Ссылка
					|	И ЗадолженностиПоДенежнымСредствамПоПоручениям.Основание = &Основание
					|	И ЗадолженностиПоДенежнымСредствамПоПоручениям.Активность
					|	И ЗадолженностиПоДенежнымСредствамПоПоручениям.Организация = &Организация
					|	И ЗадолженностиПоДенежнымСредствамПоПоручениям.СчетДоверительногоУправления = &СчетДоверительногоУправления
					|	И ЗадолженностиПоДенежнымСредствамПоПоручениям.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
					|	И ЗадолженностиПоДенежнымСредствамПоПоручениям.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)";
				
				Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
				Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
				Запрос.УстановитьПараметр("Основание", ЭтотОбъект.Основание);
				Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				Если Не РезультатЗапроса.Пустой() Тогда
					
					Выборка = РезультатЗапроса.Выбрать();
					
					Пока Выборка.Следующий() Цикл
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("На основании задолженности уже создан документ [" + Выборка.Регистратор + "]", ЭтотОбъект, "Основание",, Отказ);	
					КонецЦикла;
					
				КонецЕсли;
						
			КонецЕсли;
			
		Иначе
			
			Если ЗначениеЗаполнено(ЭтотОбъект.Основание) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У поручения заполнен документ основание [" + ЭтотОбъект.Основание + "]. При способе передачи поручений [" + ЭтотОбъект.СпособПередачи + "] основание не заполняется.", ЭтотОбъект, "СпособПередачи",, Отказ);	
			КонецЕсли;
			
			РаботаСДокументами.ПроверитьРеквизитыВводаВыводаДенежныхСредств(ЭтотОбъект, Отказ);
			
			Если Не ЗначениеЗаполнено(ЭтотОбъект.ДатаИВремяПолучения) 
				И ЭтотОбъект.Дата >= РаботаСДокументами.ДатаНачалаПроверкиДатыИВремениПолученияДляПорученийНаДвижениеАктивов()
				И РаботаСДокументами.СчетДоверительногоУправленияПоЛицензииПоУправлениюЦеннымиБумагами(ЭтотОбъект.Дата, ЭтотОбъект.СчетДоверительногоУправления) Тогда
					
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана дата и время получения документа.", ЭтотОбъект, "Объект.ДатаИВремяПолучения",, Отказ);
			
			КонецЕсли; 
			
		КонецЕсли; 
						
		Если Не Отказ Тогда
			Отказ = Не РаботаСДокументами.РазрешенВыводАктивовКонтрагенту(ЭтотОбъект);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если Не Отказ Тогда
		
		РаботаСЖурналамиОпераций.ПриЗаписиДокумента(ЭтотОбъект);
		
		 Если ЭтотОбъект.ДополнительныеСвойства.ЭтоНовый
			Или РаботаСДокументами.ИзмененыРеквизитыШапкиДокумента(ЭтотОбъект, "СчетДоверительногоУправления, РасчетныйСчетПолучатель, Основание, ВыводВсехАктивов, СпособПередачи, Сумма, Валюта, ДатаИсполненияС, ДатаИсполненияПо")
				И ЭтотОбъект.ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Проведение
			Или ЭтотОбъект.ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда 
			
			ПарметрыРегламентногоЗадания = Новый Структура("Организация, Поручение, ЭтоНовый", ЭтотОбъект.Организация, ЭтотОбъект.Ссылка, ЭтотОбъект.ДополнительныеСвойства.ЭтоНовый);
			
			Обработки.СогласованиеПредстоящихРасходов.СоздатьОтложенноеЗаданиеФормированияОповещения("СформироватьОповещенияОНовыхПорученияхНаВыводДС", ПарметрыРегламентногоЗадания);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
		
	РаботаСДокументами.СформироватьДвиженияПоРегистрамБэкОфиса(ЭтотОбъект, Отказ);
	
	РаботаСДокументами.СформироватьПроводки(ЭтотОбъект, Отказ);
		
КонецПроцедуры
	
#КонецОбласти
